---
kind: property
id: P:Autodesk.Revit.DB.Events.FamilyLoadingIntoDocumentEventArgs.FamilyName
source: html/ec272d75-d6d5-db03-57bd-12415ca6abf5.htm
---
# Autodesk.Revit.DB.Events.FamilyLoadingIntoDocumentEventArgs.FamilyName Property

The file name of the family that is being loaded into the document.

## Syntax (C#)
```csharp
public string FamilyName { get; }
```